Solodros/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437xx/at32f435_437xx.h
#if defined (AT32F435CMU7) || defined (AT32F435CMT7) || defined (AT32F435RMT7) || \
    defined (AT32F435VMT7) || defined (AT32F435ZMT7) || defined (AT32F437RMT7) || \
    defined (AT32F437VMT7) || defined (AT32F437ZMT7)
#define FLASH_BANK1_START_ADDR           ((uint32_t)0x08000000) /*!< flash start address of bank1 */
#define FLASH_BANK1_END_ADDR             ((uint32_t)0x081FFFFF) /*!< flash end address of bank1 */
#define FLASH_BANK2_START_ADDR           ((uint32_t)0x08200000) /*!< flash start address of bank2 */
#define FLASH_BANK2_END_ADDR             ((uint32_t)0x083EFFFF) /*!< flash end address of bank2 */
#else
#define FLASH_BANK1_START_ADDR           ((uint32_t)0x08000000) /*!< flash start address of bank1 */
#define FLASH_BANK1_END_ADDR             ((uint32_t)0x0807FFFF) /*!< flash end address of bank1 */
#define FLASH_BANK2_START_ADDR           ((uint32_t)0x08080000) /*!< flash start address of bank2 */
#define FLASH_BANK2_END_ADDR             ((uint32_t)0x080FFFFF) /*!< flash end address of bank2 */
#endif

#define FLASHSIZE_BASE                   ((uint32_t)0x1FFFF7E0U) /*!< FLASH Size register base address */
#define UID_BASE                         ((uint32_t)0x1FFFF7E8U) /*!< Unique device ID register base address */

/**
  * @}
  */


/** @addtogroup Bit_definition
  * @{
  */
/******************  Bit definition for CRM_CTRL register  *****************/
#define CRM_CTRL_HICKEN                  (0x1U << 0)
#define CRM_CTRL_HICKSTBL                (0x1U << 1)
#define CRM_CTRL_HICKTRIM                (0x3FU << 2)
#define CRM_CTRL_HEXTEN                  (0x1U << 16)
#define CRM_CTRL_HEXTSTBL                (0x1U << 17)
#define CRM_CTRL_HEXTBYPS                (0x1U << 18)
#define CRM_CTRL_CFDEN                   (0x1U << 19)
#define CRM_CTRL_PLLEN                   (0x1U << 24)
#define CRM_CTRL_PLLSTBL                 (0x1U << 25)

/******************  Bit definition for CRM_CFG register  ******************/
#define CRM_CFG_SCLKSEL                  (0x3U << 0)
#define CRM_CFG_SCLK_HICK                (0x0U << 0)
#define CRM_CFG_SCLK_HEXT                (0x1U << 0)
#define CRM_CFG_SCLK_PLL                 (0x2U << 0)
#define CRM_CFG_SCLKSTS                  (0x3U << 2)
#define CRM_CFG_SCLKSTS_HICK             (0x0U << 2)
#define CRM_CFG_SCLKSTS_HEXT             (0x1U << 2)
#define CRM_CFG_SCLKSTS_PLL              (0x2U << 2)

/*****************  Bit definition for CRM_AHBRST1 register  ***************/
#define CRM_AHBRST1_GPIOARST             (0x1U << 0)
#define CRM_AHBRST1_GPIOBRST             (0x1U << 1)
#define CRM_AHBRST1_GPIOCRST             (0x1U << 2)
#define CRM_AHBRST1_GPIODRST             (0x1U << 3)
#define CRM_AHBRST1_GPIOERST             (0x1U << 4)
#define CRM_AHBRST1_GPIOFRST             (0x1U << 5)
#define CRM_AHBRST1_GPIOGRST             (0x1U << 6)
#define CRM_AHBRST1_GPIOHRST             (0x1U << 7)
#define CRM_AHBRST1_CRCRST               (0x1U << 12)
#define CRM_AHBRST1_EDMARST              (0x1U << 21)
#define CRM_AHBRST1_DMA1RST              (0x1U << 22)
#define CRM_AHBRST1_DMA2RST              (0x1U << 24)
#define CRM_AHBRST1_EMACRST              (0x1U << 25)
#define CRM_AHBRST1_OTGFS2RST            (0x1U << 29)

/*****************  Bit definition for CRM_AHBRST2 register  ***************/
#define CRM_AHBRST2_DVPRST               (0x1U << 0)
#define CRM_AHBRST2_OTGFS1RST            (0x1U << 7)
#define CRM_AHBRST2_SDIO1RST             (0x1U << 15)

/*****************  Bit definition for CRM_AHBRST3 register  ***************/
#define CRM_AHBRST3_XMCRST               (0x1U << 0)
#define CRM_AHBRST3_QSPI1RST             (0x1U << 1)
#define CRM_AHBRST3_QSPI2RST             (0x1U << 14)
#define CRM_AHBRST3_SDIO2RST             (0x1U << 15)

/*****************  Bit definition for CRM_APB1RST register  ***************/
#define CRM_APB1RST_TMR2RST              (0x1U << 0)
#define CRM_APB1RST_TMR3RST              (0x1U << 1)
#define CRM_APB1RST_TMR4RST              (0x1U << 2)
#define CRM_APB1RST_TMR5RST              (0x1U << 3)
#define CRM_APB1RST_TMR6RST              (0x1U << 4)
#define CRM_APB1RST_TMR7RST              (0x1U << 5)
#define CRM_APB1RST_TMR12RST             (0x1U << 6)
#define CRM_APB1RST_TMR13RST             (0x1U << 7)
#define CRM_APB1RST_TMR14RST             (0x1U << 8)
#define CRM_APB1RST_WWDTRST              (0x1U << 11)
#define CRM_APB1RST_SPI2RST              (0x1U << 14)
#define CRM_APB1RST_SPI3RST              (0x1U << 15)
#define CRM_APB1RST_USART2RST            (0x1U << 17)
#define CRM_APB1RST_USART3RST            (0x1U << 18)
#define CRM_APB1RST_UART4RST             (0x1U << 19)
#define CRM_APB1RST_UART5RST             (0x1U << 20)
#define CRM_APB1RST_I2C1RST              (0x1U << 21)
#define CRM_APB1RST_I2C2RST              (0x1U << 22)
#define CRM_APB1RST_I2C3RST              (0x1U << 23)
#define CRM_APB1RST_CAN1RST              (0x1U << 25)
#define CRM_APB1RST_CAN2RST              (0x1U << 26)
#define CRM_APB1RST_PWCRST               (0x1U << 28)
#define CRM_APB1RST_DACRST               (0x1U << 29)
#define CRM_APB1RST_UART7RST             (0x1U << 30)
#define CRM_APB1RST_UART8RST             (0x1U << 31)

/*****************  Bit definition for CRM_APB2RST register  ***************/
#define CRM_APB2RST_TMR1RST              (0x1U << 0)
#define CRM_APB2RST_TMR8RST              (0x1U << 1)
#define CRM_APB2RST_USART1RST            (0x1U << 4)
#define CRM_APB2RST_USART6RST            (0x1U << 5)
#define CRM_APB2RST_ADC1RST              (0x1U << 8)
#define CRM_APB2RST_ADC2RST              (0x1U << 8)
#define CRM_APB2RST_ADC3RST              (0x1U << 8)
#define CRM_APB2RST_SPI1RST              (0x1U << 12)
#define CRM_APB2RST_SPI4RST              (0x1U << 13)
#define CRM_APB2RST_SCFGRST              (0x1U << 14)
#define CRM_APB2RST_TMR9RST              (0x1U << 16)
#define CRM_APB2RST_TMR10RST             (0x1U << 17)
#define CRM_APB2RST_TMR11RST             (0x1U << 18)
#define CRM_APB2RST_TMR20RST             (0x1U << 20)
#define CRM_APB2RST_ACCRST               (0x1U << 29)

/*****************  Bit definition for CRM_AHBEN1 register  ***************/
#define CRM_AHBEN1_GPIOAEN               (0x1U << 0)
#define CRM_AHBEN1_GPIOBEN               (0x1U << 1)
#define CRM_AHBEN1_GPIOCEN               (0x1U << 2)
#define CRM_AHBEN1_GPIODEN               (0x1U << 3)
#define CRM_AHBEN1_GPIOEEN               (0x1U << 4)
#define CRM_AHBEN1_GPIOFEN               (0x1U << 5)
#define CRM_AHBEN1_GPIOGEN               (0x1U << 6)
#define CRM_AHBEN1_GPIOHEN               (0x1U << 7)
#define CRM_AHBEN1_CRCEN                 (0x1U << 12)
#define CRM_AHBEN1_EDMAEN                (0x1U << 21)
#define CRM_AHBEN1_DMA1EN                (0x1U << 22)
#define CRM_AHBEN1_DMA2EN                (0x1U << 24)
#define CRM_AHBEN1_EMACEN                (0x1U << 25)
#define CRM_AHBEN1_OTGFS2EN              (0x1U << 29)

/*****************  Bit definition for CRM_AHBEN2 register  ***************/
#define CRM_AHBEN2_DVPEN                 (0x1U << 0)
#define CRM_AHBEN2_OTGFS1EN              (0x1U << 7)
#define CRM_AHBEN2_SDIO1EN               (0x1U << 15)

/*****************  Bit definition for CRM_AHBEN3 register  ***************/
#define CRM_AHBEN3_XMCEN                 (0x1U << 0)
#define CRM_AHBEN3_QSPI1EN               (0x1U << 1)
#define CRM_AHBEN3_QSPI2EN               (0x1U << 14)
#define CRM_AHBEN3_SDIO2EN               (0x1U << 15)

/*****************  Bit definition for CRM_APB1EN register  ***************/
#define CRM_APB1EN_TMR2EN                (0x1U << 0)
#define CRM_APB1EN_TMR3EN                (0x1U << 1)
#define CRM_APB1EN_TMR4EN                (0x1U << 2)
#define CRM_APB1EN_TMR5EN                (0x1U << 3)
#define CRM_APB1EN_TMR6EN                (0x1U << 4)
#define CRM_APB1EN_TMR7EN                (0x1U << 5)
#define CRM_APB1EN_TMR12EN               (0x1U << 6)
#define CRM_APB1EN_TMR13EN               (0x1U << 7)
#define CRM_APB1EN_TMR14EN               (0x1U << 8)
#define CRM_APB1EN_WWDTEN                (0x1U << 11)
#define CRM_APB1EN_SPI2EN                (0x1U << 14)
#define CRM_APB1EN_SPI3EN                (0x1U << 15)
#define CRM_APB1EN_USART2EN              (0x1U << 17)
#define CRM_APB1EN_USART3EN              (0x1U << 18)
#define CRM_APB1EN_UART4EN               (0x1U << 19)
#define CRM_APB1EN_UART5EN               (0x1U << 20)
#define CRM_APB1EN_I2C1EN                (0x1U << 21)
#define CRM_APB1EN_I2C2EN                (0x1U << 22)
#define CRM_APB1EN_I2C3EN                (0x1U << 23)
#define CRM_APB1EN_CAN1EN                (0x1U << 25)
#define CRM_APB1EN_CAN2EN                (0x1U << 26)
#define CRM_APB1EN_PWCEN                 (0x1U << 28)
#define CRM_APB1EN_DACEN                 (0x1U << 29)
#define CRM_APB1EN_UART7EN               (0x1U << 30)
#define CRM_APB1EN_UART8EN               (0x1U << 31)

/*****************  Bit definition for CRM_APB2EN register  ***************/
#define CRM_APB2EN_TMR1EN                (0x1U << 0)
#define CRM_APB2EN_TMR8EN                (0x1U << 1)
#define CRM_APB2EN_USART1EN              (0x1U << 4)
#define CRM_APB2EN_USART6EN              (0x1U << 5)
#define CRM_APB2EN_ADC1EN                (0x1U << 8)
#define CRM_APB2EN_ADC2EN                (0x1U << 9)
#define CRM_APB2EN_ADC3EN                (0x1U << 10)
#define CRM_APB2EN_SPI1EN                (0x1U << 12)
#define CRM_APB2EN_SPI4EN                (0x1U << 13)
#define CRM_APB2EN_SCFGEN                (0x1U << 14)
#define CRM_APB2EN_TMR9EN                (0x1U << 16)
#define CRM_APB2EN_TMR10EN               (0x1U << 17)
#define CRM_APB2EN_TMR11EN               (0x1U << 18)
#define CRM_APB2EN_TMR20EN               (0x1U << 20)
#define CRM_APB2EN_ACCEN                 (0x1U << 29)

/*****************  Bit definition for CRM_AHBLPEN1 register  ***************/
#define CRM_AHBLPEN1_GPIOALPEN           (0x1U << 0)
#define CRM_AHBLPEN1_GPIOBLPEN           (0x1U << 1)
#define CRM_AHBLPEN1_GPIOCLPEN           (0x1U << 2)
#define CRM_AHBLPEN1_GPIODLPEN           (0x1U << 3)
#define CRM_AHBLPEN1_GPIOELPEN           (0x1U << 4)
#define CRM_AHBLPEN1_GPIOFLPEN           (0x1U << 5)
#define CRM_AHBLPEN1_GPIOGLPEN           (0x1U << 6)
#define CRM_AHBLPEN1_GPIOHLPEN           (0x1U << 7)
#define CRM_AHBLPEN1_CRCLPEN             (0x1U << 12)
#define CRM_AHBLPEN1_EDMALPEN            (0x1U << 21)
#define CRM_AHBLPEN1_DMA1LPEN            (0x1U << 22)
#define CRM_AHBLPEN1_DMA2LPEN            (0x1U << 24)
#define CRM_AHBLPEN1_EMACLPEN            (0x1U << 25)
#define CRM_AHBLPEN1_OTGFS2LPEN          (0x1U << 29)

